<a href="https://colab.research.google.com/github/leejyy/New/blob/master/Salaries.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import numpy as np
import pandas as pd

In [2]:
data=pd.read_csv('/content/drive/MyDrive/Colab Notebooks/projects/salaries/Salaries.csv')

In [3]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148654 non-null  object
 2   JobTitle          148654 non-null  object
 3   BasePay           148045 non-null  float64
 4   OvertimePay       148650 non-null  float64
 5   OtherPay          148650 non-null  float64
 6   Benefits          112491 non-null  float64
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Notes             0 non-null       float64
 11  Agency            148654 non-null  object
 12  Status            0 non-null       float64
dtypes: float64(8), int64(2), object(3)
memory usage: 14.7+ MB

In [19]:
data.max()

Id                         148654
EmployeeName           Zuri Jones
JobTitle              ZOO CURATOR
BasePay                    319275
OvertimePay                245132
OtherPay                   400184
Benefits                  96570.7
TotalPay                   567595
TotalPayBenefits           567595
Year                         2014
Notes                         NaN
Agency              San Francisco
Status                        NaN
dtype: object

In [20]:
data.count()

Id                  148654
EmployeeName        148654
JobTitle            148654
BasePay             148045
OvertimePay         148650
OtherPay            148650
Benefits            112491
TotalPay            148654
TotalPayBenefits    148654
Year                148654
Notes                    0
Agency              148654
Status                   0
dtype: int64

In [21]:
data.min()

Id                                 1
EmployeeName        A BERNARD FATOOH
JobTitle               ACCOUNT CLERK
BasePay                      -166.01
OvertimePay                    -0.01
OtherPay                    -7058.59
Benefits                      -33.89
TotalPay                     -618.13
TotalPayBenefits             -618.13
Year                            2011
Notes                            NaN
Agency                 San Francisco
Status                           NaN
dtype: object

In [24]:
def sum_integers(num):
  sum=0
  if num!=int (num):
    print("wrong input...BYE!")
  else:
    for x in range (num+1):
      sum=sum+1
  print(f'The sum is, {sum}')

In [27]:
sum_integers(0.5)

wrong input...BYE!
The sum is, 0

In [28]:
data.head(10)

   Id        EmployeeName  ...         Agency  Status
0   1      NATHANIEL FORD  ...  San Francisco     NaN
1   2        GARY JIMENEZ  ...  San Francisco     NaN
2   3      ALBERT PARDINI  ...  San Francisco     NaN
3   4   CHRISTOPHER CHONG  ...  San Francisco     NaN
4   5     PATRICK GARDNER  ...  San Francisco     NaN
5   6      DAVID SULLIVAN  ...  San Francisco     NaN
6   7           ALSON LEE  ...  San Francisco     NaN
7   8       DAVID KUSHNER  ...  San Francisco     NaN
8   9      MICHAEL MORRIS  ...  San Francisco     NaN
9  10  JOANNE HAYES-WHITE  ...  San Francisco     NaN

[10 rows x 13 columns]

What is the average BasePay?

In [29]:
data['BasePay'].mean()

66325.44884050643

What is the highest amount of overtime in the dataset?

In [30]:
data['OvertimePay'].max()

245131.88

What is the job title of Joseph Driscoll?

In [33]:
data[data['EmployeeName']=='JOSEPH DRISCOLL']['JobTitle']

24    CAPTAIN, FIRE SUPPRESSION
Name: JobTitle, dtype: object

How much does Joseph Driscoll make?

In [34]:
data[data['EmployeeName']=='JOSEPH DRISCOLL']['TotalPayBenefits']

24    270324.91
Name: TotalPayBenefits, dtype: float64

What is the name of the highest paid person?(Including benefits)

In [37]:
data[data['TotalPayBenefits']==data['TotalPayBenefits'].max()]
data.loc['TotalPayBenefits'].idxmax()
data[data['TotalPayBenefits']==data['EmployeeName'].max()]

   Id    EmployeeName  ...         Agency  Status
0   1  NATHANIEL FORD  ...  San Francisco     NaN

[1 rows x 13 columns]

What is the name of the lowest paid person?(Including benefits)

In [38]:
data[data['TotalPayBenefits']==data['TotalPayBenefits'].min()]

            Id EmployeeName  ...         Agency  Status
148653  148654    Joe Lopez  ...  San Francisco     NaN

[1 rows x 13 columns]

What was the average (mean) basepay of all emploees per year?

In [39]:
data.groupby('Year').mean()['BasePay']

Year
2011    63595.956517
2012    65436.406857
2013    69630.030216
2014    66564.421924
Name: BasePay, dtype: float64

How many unique job title are there?

In [41]:
data['JobTitle'].nunique()

2159

What are the top 5 most common job?

In [42]:
data['JobTitle'].value_counts().head()

Transit Operator                7036
Special Nurse                   4389
Registered Nurse                3736
Public Svc Aide-Public Works    2518
Police Officer 3                2421
Name: JobTitle, dtype: int64

How many job titles were represented by only one person in 2013?

In [43]:
sum(data[data['Year']==2013]['JobTitle'].value_counts()==1)

202

How many peopel habe the world chief in their job title?

In [46]:
def chief_string(title):
  if 'chief' in title.lower():
    return True
  else:
    return False

In [47]:
sum(data['JobTitle'].apply(lambda x:chief_string(x)))

627